reports/stage5/wrkLogsGet1.txt
Running 50s test @ http://localhost:8080
  2 threads and 10 connections
  Thread calibration: mean lat.: 1.661ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.636ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.64ms  511.21us   6.62ms   69.67%
    Req/Sec   526.87     73.48     0.89k    78.40%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.61ms
 75.000%    1.95ms
 90.000%    2.29ms
 99.000%    2.98ms
 99.900%    3.92ms
 99.990%    5.82ms
 99.999%    6.63ms
100.000%    6.63ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.321     0.000000            1         1.00
       1.008     0.100000         4004         1.11
       1.202     0.200000         7999         1.25
       1.354     0.300000        12017         1.43
       1.486     0.400000        16014         1.67
       1.612     0.500000        19998         2.00
       1.675     0.550000        21996         2.22
       1.741     0.600000        24005         2.50
       1.807     0.650000        26010         2.86
       1.877     0.700000        28002         3.33
       1.952     0.750000        29987         4.00
       1.994     0.775000        31002         4.44
       2.039     0.800000        31994         5.00
       2.089     0.825000        32988         5.71
       2.145     0.850000        33997         6.67
       2.213     0.875000        35008         8.00
       2.247     0.887500        35484         8.89
       2.289     0.900000        35982        10.00
       2.337     0.912500        36477        11.43
       2.393     0.925000        36992        13.33
       2.451     0.937500        37486        16.00
       2.487     0.943750        37726        17.78
       2.525     0.950000        37987        20.00
       2.569     0.956250        38230        22.86
       2.619     0.962500        38483        26.67
       2.675     0.968750        38733        32.00
       2.697     0.971875        38850        35.56
       2.731     0.975000        38977        40.00
       2.771     0.978125        39102        45.71
       2.817     0.981250        39229        53.33
       2.863     0.984375        39353        64.00
       2.885     0.985938        39416        71.11
       2.917     0.987500        39477        80.00
       2.955     0.989062        39537        91.43
       3.003     0.990625        39602       106.67
       3.055     0.992188        39664       128.00
       3.079     0.992969        39694       142.22
       3.117     0.993750        39726       160.00
       3.151     0.994531        39756       182.86
       3.193     0.995313        39787       213.33
       3.239     0.996094        39818       256.00
       3.279     0.996484        39835       284.44
       3.319     0.996875        39850       320.00
       3.397     0.997266        39865       365.71
       3.487     0.997656        39883       426.67
       3.575     0.998047        39896       512.00
       3.629     0.998242        39904       568.89
       3.679     0.998437        39912       640.00
       3.741     0.998633        39920       731.43
       3.867     0.998828        39928       853.33
       3.945     0.999023        39936      1024.00
       3.961     0.999121        39939      1137.78
       4.019     0.999219        39943      1280.00
       4.147     0.999316        39947      1462.86
       4.243     0.999414        39951      1706.67
       4.279     0.999512        39955      2048.00
       4.395     0.999561        39957      2275.56
       4.447     0.999609        39959      2560.00
       4.567     0.999658        39961      2925.71
       4.611     0.999707        39963      3413.33
       4.915     0.999756        39965      4096.00
       5.003     0.999780        39966      4551.11
       5.011     0.999805        39967      5120.00
       5.127     0.999829        39968      5851.43
       5.599     0.999854        39969      6826.67
       5.823     0.999878        39970      8192.00
       5.823     0.999890        39970      9102.22
       5.831     0.999902        39971     10240.00
       5.831     0.999915        39971     11702.86
       6.307     0.999927        39972     13653.33
       6.307     0.999939        39972     16384.00
       6.307     0.999945        39972     18204.44
       6.499     0.999951        39973     20480.00
       6.499     0.999957        39973     23405.71
       6.499     0.999963        39973     27306.67
       6.499     0.999969        39973     32768.00
       6.499     0.999973        39973     36408.89
       6.627     0.999976        39974     40960.00
       6.627     1.000000        39974          inf
#[Mean    =        1.640, StdDeviation   =        0.511]
#[Max     =        6.624, Total count    =        39974]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    0.93ms
 75.000%    1.12ms
 90.000%    1.33ms
 99.000%    1.87ms
 99.900%    3.09ms
 99.990%    5.08ms
 99.999%    5.45ms
100.000%    5.45ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.168     0.000000            1         1.00
       0.546     0.100000         4001         1.11
       0.694     0.200000         8018         1.25
       0.788     0.300000        12001         1.43
       0.862     0.400000        16053         1.67
       0.930     0.500000        20033         2.00
       0.964     0.550000        21996         2.22
       1.000     0.600000        24023         2.50
       1.037     0.650000        26012         2.86
       1.077     0.700000        27997         3.33
       1.124     0.750000        29999         4.00
       1.149     0.775000        30998         4.44
       1.179     0.800000        31997         5.00
       1.209     0.825000        33003         5.71
       1.242     0.850000        34001         6.67
       1.281     0.875000        34996         8.00
       1.304     0.887500        35507         8.89
       1.328     0.900000        35990        10.00
       1.357     0.912500        36479        11.43
       1.390     0.925000        36976        13.33
       1.430     0.937500        37480        16.00
       1.457     0.943750        37735        17.78
       1.483     0.950000        37985        20.00
       1.513     0.956250        38232        22.86
       1.544     0.962500        38480        26.67
       1.584     0.968750        38729        32.00
       1.612     0.971875        38853        35.56
       1.641     0.975000        38975        40.00
       1.674     0.978125        39103        45.71
       1.706     0.981250        39225        53.33
       1.750     0.984375        39352        64.00
       1.777     0.985938        39412        71.11
       1.806     0.987500        39476        80.00
       1.843     0.989062        39538        91.43
       1.901     0.990625        39601       106.67
       1.962     0.992188        39665       128.00
       1.990     0.992969        39693       142.22
       2.028     0.993750        39726       160.00
       2.073     0.994531        39756       182.86
       2.133     0.995313        39788       213.33
       2.201     0.996094        39818       256.00
       2.263     0.996484        39835       284.44
       2.309     0.996875        39850       320.00
       2.367     0.997266        39865       365.71
       2.443     0.997656        39881       426.67
       2.585     0.998047        39896       512.00
       2.631     0.998242        39904       568.89
       2.697     0.998437        39912       640.00
       2.811     0.998633        39920       731.43
       2.909     0.998828        39928       853.33
       3.209     0.999023        39935      1024.00
       3.367     0.999121        39939      1137.78
       3.429     0.999219        39943      1280.00
       3.625     0.999316        39947      1462.86
       3.695     0.999414        39951      1706.67
       3.745     0.999512        39955      2048.00
       3.775     0.999561        39957      2275.56
       3.803     0.999609        39959      2560.00
       3.807     0.999658        39961      2925.71
       3.889     0.999707        39963      3413.33
       4.043     0.999756        39965      4096.00
       4.143     0.999780        39966      4551.11
       4.231     0.999805        39967      5120.00
       4.247     0.999829        39968      5851.43
       4.943     0.999854        39969      6826.67
       5.079     0.999878        39970      8192.00
       5.079     0.999890        39970      9102.22
       5.319     0.999902        39971     10240.00
       5.319     0.999915        39971     11702.86
       5.379     0.999927        39972     13653.33
       5.379     0.999939        39972     16384.00
       5.379     0.999945        39972     18204.44
       5.403     0.999951        39973     20480.00
       5.403     0.999957        39973     23405.71
       5.403     0.999963        39973     27306.67
       5.403     0.999969        39973     32768.00
       5.403     0.999973        39973     36408.89
       5.447     0.999976        39974     40960.00
       5.447     1.000000        39974          inf
#[Mean    =        0.947, StdDeviation   =        0.330]
#[Max     =        5.444, Total count    =        39974]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  49994 requests in 50.00s, 5.99MB read
Requests/sec:    999.85
Transfer/sec:    122.59KB